
#                                                       Задача 1.

# Создать телефонный справочник с возможностью импорта и экспорта данных в формате .txt. Фамилия, имя, отчество, номер телефона - данные, которые должны находиться в файле.

# 1. Программа должна выводить данные
# 2. Программа должна сохранять данные в текстовом файле
# 3. Пользователь может ввести одну из характеристик для поиска определенной записи(Например имя или фамилию человека)
# 4. Использование функций. Ваша программа не должна быть линейной

# Создаем два файла. В первом файле имя, фамелия, номер телефона и адрес у нас будит храниться на каждой новой строке.

# name1
# surname
# phone
# address

# name1
# surname
# phone
# address

# Во втором файле мы будим хранить через точку с запятой

# name1; surname; phone; address
# name2; surname; phone; address

# Программу будем делать при помощи модулей. Тоесть у нас будит не один файл где будим посать обсолютно все функции, а несколько файлов откудо будим импортировать различные функции.
# Для начало создае наш основной файл

