# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали
# одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

#                                       Пример

# 6 -> 1 4 1
# 24 -> 4 16 4
# 60 -> 10 40 10



s = int(input('Сколько журавликов сделали дети? ')) // 3
print(f'{s // 2} сделал Петя, {s * 2} сделала Катя, {s // 2} сделал Сережа')






















# print(f'нам нужно - {s1+s2+s3} парты')